<a href="https://colab.research.google.com/github/anakhabose/Learn.py/blob/main/TASK_19.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Create a DataFrame by passing a random numpy array,with a dateted index and labelled columns and display,
  - where values of the column A is greater than 0.
  - where values of the columns A is greater than 0 and B greater than -1.
  - where values of the columns A  is greater than 0 or B greater than -1.

In [137]:
#please type your code below this line.
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates ,columns=list('ABCD'))
df

                   A         B         C         D
2021-01-01  0.115094  0.658871 -1.133046  0.792560
2021-01-02 -0.455057  0.964447  2.157943 -1.498099
2021-01-03 -0.169385 -1.032906  0.580209  0.071748
2021-01-04  0.888194  1.333278  1.433681  0.489122
2021-01-05 -0.508914 -0.451103 -1.090664  0.984675
2021-01-06  0.265470 -0.846885  0.913885 -0.634669

In [142]:
#values if A, >0
value = df["A"] >0
value

2021-01-01     True
2021-01-02    False
2021-01-03    False
2021-01-04     True
2021-01-05    False
2021-01-06     True
Freq: D, Name: A, dtype: bool

In [143]:
#A>0 and B>-1
x = df["A"] >0
y = df["B"] >-1
x & y

2021-01-01     True
2021-01-02    False
2021-01-03    False
2021-01-04     True
2021-01-05    False
2021-01-06     True
Freq: D, dtype: bool

In [144]:
#A>0 or B>-1
x | y

2021-01-01     True
2021-01-02     True
2021-01-03    False
2021-01-04     True
2021-01-05     True
2021-01-06     True
Freq: D, dtype: bool

2. Create a DataFrame by passing a random numpy array,with a dateted index and labelled columns and check if ,
  - the values of the table are greater the zero or not.
  - the value at the postion (0,0) is equal to NaN or not.

In [146]:
#please type your code below this line.
 
 
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=5)
df1 = pd.DataFrame(np.random.randn(5,4),index=dates ,columns=list('ABCD'))
df1

                   A         B         C         D
2021-01-01 -0.454508 -2.072146  0.437977 -1.213780
2021-01-02  0.810879  0.196125 -0.924421 -0.508119
2021-01-03  0.770538 -0.703313 -1.257789 -0.805553
2021-01-04 -0.036742 -0.274393  0.255451 -1.147444
2021-01-05 -0.634778 -1.861693 -0.393391  0.180819

In [147]:
#check >0
x = df1>0
x

                A      B      C      D
2021-01-01  False  False   True  False
2021-01-02   True   True  False  False
2021-01-03   True  False  False  False
2021-01-04  False  False   True  False
2021-01-05  False  False  False   True

In [148]:
#chevk NaN(0,0)
df.iloc[0,0]==np.nan

False

3. Create a DataFrame by passing a random numpy array,with a dateted index and labelled columns and,
  - reindex the index with even dates.
  - create a column with values NaN.
  - make the values of the first two index of the newly created column as 1

In [131]:
#please type your answer below this line.
 
 
import pandas as pd
import numpy as np
dates = pd.date_range('20210101',periods=4)
df2 = pd.DataFrame(np.random.randn(4,4),index=dates ,columns=list('ABCD'))
df2

                   A         B         C         D
2021-01-01 -0.163922 -0.702141 -0.546585  0.436791
2021-01-02  1.379752  1.287807  0.058288  0.513311
2021-01-03 -0.952541  0.433414 -0.523059 -0.205490
2021-01-04  1.153511  0.966109 -1.919304  1.234664

In [134]:
#reindex
index2 = pd.date_range('20210102', periods=4 ,freq="2D")
df3 = df2.reindex(index2)
df3

                   A         B         C         D
2021-01-02  1.379752  1.287807  0.058288  0.513311
2021-01-04  1.153511  0.966109 -1.919304  1.234664
2021-01-06       NaN       NaN       NaN       NaN
2021-01-08       NaN       NaN       NaN       NaN

In [135]:
#NaN
NaN = np.nan
df2["B"] = NaN
df2

                   A   B         C         D
2021-01-01 -0.163922 NaN -0.546585  0.436791
2021-01-02  1.379752 NaN  0.058288  0.513311
2021-01-03 -0.952541 NaN -0.523059 -0.205490
2021-01-04  1.153511 NaN -1.919304  1.234664

In [136]:
#changing values
df2.iat[0,1] = '1'
df2.iat[1,1] = '1'
df2

                   A    B         C         D
2021-01-01 -0.163922  1.0 -0.546585  0.436791
2021-01-02  1.379752  1.0  0.058288  0.513311
2021-01-03 -0.952541  NaN -0.523059 -0.205490
2021-01-04  1.153511  NaN -1.919304  1.234664